==================
Simplest Object
==================

Object;

-----
(source_file
    (object
        class_name: (identifier)
    )
)


==================
Data list followed by a has statement
==================

Object -> "bolted cupboard"
  with name "bolted" "cupboard",
       describe
       [; if (self hasnt open) "^A shut cupboard is bolted to one wall.";
          "^Bolted up on one wall is an open cupboard.";
       ],
       with_key key
  has  locked container openable lockable static;

-----

   (source_file
      (object
        (identifier)
        (string_double_quoted)
        (object_body
          (prop_mod)
          (identifier)
          (string_double_quoted)
          (string_double_quoted)
          (identifier)
          (embedded_routine
            (function_sig)
            (conditional
              (binary_expression
                (identifier)
                (operator)
                (identifier))
              (return
                (string_double_quoted)))
            (return
              (string_double_quoted)))
          (identifier)
          (identifier)
          (prop_mod)
          (identifier)
          (identifier)
          (identifier)
          (identifier)
          (identifier))))

==================
Object with props
==================

Object magpie "black-striped bird"
    with wingspan, worms_eaten;

-----
(source_file
    (object
        class_name: (identifier)
        label: (identifier)
        sdec: (string_double_quoted)
        (object_body
            (prop_mod)
            data_id: (identifier)
            data_id: (identifier)
        )
    )
)

==================
Has parsing
==================

Scenic  -> "~Y2~ rock"
  with  name 'rock' 'y2',
        description "There is a large ~Y2~ painted on the rock.",
  has supporter;

-----

(source_file
    (object
        class_name: (identifier)
        sdec: (string_double_quoted)
        (object_body
            (prop_mod)
            data_id: (identifier)
            (string_single_quoted)
            (string_single_quoted)
            data_id: (identifier)
            (string_double_quoted)
            (prop_mod)
            data_id: (identifier)
        )
    )
)


==================
Object with embedded routine and data list
==================

Object magpie "black-striped bird"
    with name 'magpie' 'bird' 'black-striped' 'black' 'striped',
    wingspan 5,
    flying_strength [;
        return magpie.wingspan + magpie.worms_eaten;
    ],
    worms_eaten;

-----
(source_file
    (object
        class_name: (identifier)
        label: (identifier)
        sdec: (string_double_quoted)
        (object_body
            (prop_mod)
            data_id: (identifier)
            (string_single_quoted)
            (string_single_quoted)
            (string_single_quoted)
            (string_single_quoted)
            (string_single_quoted)
            data_id: (identifier)
            (number)
            data_id: (identifier)
            (embedded_routine
                (function_sig)
                (return
                    (binary_expression
                        (property_access
                            (identifier)
                            (identifier))
                        (operator)
                        (property_access
                            (identifier)
                            (identifier)
                        )
                    )
                )
            )
            data_id: (identifier)
        )
    )
)

==================
Object with attributes
==================

Object magpie "black-striped bird"
    with
        description "The magpie is a black-striped bird.",
    has ~animate;

-----
(source_file
    (object
        class_name: (identifier)
        label: (identifier)
        sdec: (string_double_quoted)
        (object_body
            (prop_mod)
             data_id: (identifier)
            (string_double_quoted)
            (prop_mod)
            data_id: (identifier)
        )
    )
)


==================
Object with negated attributes
==================

Object -> "toothed bag"
  with name "toothed" "bag",
       initial "In one corner is a curious, toothed bag.",
       description "A capacious bag with a toothed mouth.",

  has  ~container ~open;

-----
(source_file
    (object
        class_name: (identifier)
        sdec: (string_double_quoted)
        (object_body
            (prop_mod)
             data_id: (identifier)
            (string_double_quoted)
            (string_double_quoted)
            data_id: (identifier)
            (string_double_quoted)
            data_id: (identifier)
            (string_double_quoted)
            (prop_mod)
            data_id: (identifier)
            data_id: (identifier)
        )
    )
)

==================
Object with switch blocks in embedded_routine
==================

Object magpie "black-striped bird"
    class bird
    with
        wingspan,
        worms_eaten,
        after [;
            Take: "You pick the mushroom, neatly cleaving its thin stalk.";
            Drop: "The mushroom drops to the ground, battered slightly.";
            Fish, Examine: "The mushroom is a small, white fungus with a thin stalk.";
            Empty: ;
        ],
    has ~animate light;

-----

(source_file
    (object
        class_name: (identifier)
        label: (identifier)
        sdec: (string_double_quoted)
        (class_assignment
            (identifier)
        )
        (object_body
            (prop_mod)
            data_id: (identifier)
            data_id: (identifier)
            data_id: (identifier)
            (embedded_routine
                (function_sig)
            (switch_block
              (identifier))
            (return
              (string_double_quoted))
            (switch_block
              (identifier))
            (return
              (string_double_quoted))
            (switch_block
              (identifier)
              (identifier))
            (return
              (string_double_quoted))
            (switch_block
              (identifier)))
          (prop_mod)
          data_id: (identifier)
          data_id: (identifier))))


==================
Object messages
==================

[ Main;
    x = plant.pour_over(cold_spring_water);
];

-----

(source_file
    (routine
        (function_sig (identifier))
        (function_block
            (local_var_decl
                (identifier)
                (routine_call
                    (property_access
                        (identifier)
                        (identifier)
                    )
                     (routine_message
                            (identifier)
                        )
                )
            )
        )
    )
)


==================
Superclass messages
==================

[ Main;
   self.Treasure::deposit();
];

-----
(source_file
    (routine
        (function_sig
            (identifier)
        )
        (ERROR
            (identifier)
            (routine_call
                (property_access
                    (identifier)
                    (identifier)
                )
                (routine_message)
            )
        )
    )
)
